# однострочный комментарий
"""
Многострочный
комментарий
"""
'''
 Пример работы с целыми числами
'''
a = 150  # было 15
b = 70  # было 7
print("a = ", a)
print("b = ", b)
print("a + b = ", a + b)  # сложение чисел
print("a - b = ", a - b)  # вычитание чисел
print("a * b = ", a * b)  # умножение чисел
print("a / b = ", a / b)  # деление чисел
print("a // b = ", a // b)  # деление с округлением вниз до целого
print("a % b = ", a % b)  # остаток от деления
print("a ** b = ", a ** b)  # возведение в степень
# приведение типа int к float
a1 = float(a)
print("a1 = ", a1)
print("\n")
'''
 Пример работы с вещественными числами
'''
c = 3.5
d = 6.9
print("c = ", c)
print("d = ", d)
print("c + d = ", c + d)  # сложение чисел
print("c * d = ", c * d)  # умножение чисел
print("c / d = ", c / d)  # деление чисел
d1 = 2.3e-5
print("d1 = ", d1)
print("c + d1 = ", c + d1)  # сложение чисел
# приведение типа float к int
d2 = int(d)
print("d2 = ", d2)
6
print("\n")
'''
 Операторы присваивания
'''
e = 7
print("e = 7: ", e)
e += 3
print("e += 3: ", e)
e -= 3
print("e -= 3: ", e)
e *= 15
print("e *= 5: ", e)
e /= 4
print("e /= 4: ", e)
e //= 2
print("e //= 2: ", e)
e %= 5
print("e %= 5: ", e)
e **= 3
print("e **= 3: ", e)
print("\n")

# Модифицируйте программу lab_01_01.py,
z = 3  # создав переменную z со значением 3
y = 5  # и переменную y со значением 5.
print("z = ", z)
print("y = ", y)
print("z + y = ", z + y)  # Осуществите операции сложения,
print("z - y = ", z - y)  # вычитания,
print("z * y = ", z * y)  # умножения,
print("z / y = ", z / y)  # деления,
print("z // y = ", z // y)  # деления с округлением вниз,
print("z % y = ", z % y)  # вычисления остатка от деления
print("z ** y = ", z ** y)  # и возведения в степень над созданными переменными, выводя результаты на экран.

# Дополните код программы lab_01_01.py.
x = 105  # Создайте переменную x со значением 105
v = 58  # и v со значением 58.
print("z / y = ", float(x / v))  # Осуществите вывод результата деления переменной x на переменную v на экран с
# приведением типа к вещественному
print("z / y = ", x / v)  # и без приведения типов. Ознакомьтесь с результатом.
